app/views/developers/index.html.haml

SELECT COUNT(*) FROM "projects" WHERE "projects"."developer_id" = $1  [["developer_id", 1]]
---
    Project count:
    = developer.projects.count